{
	"question": "what's the dog's name tom and jerry",
	"similar_chunks_original": [
		{
			"content": "from an Italian dog. Topo then recognizes Tom and Jerry and befriends them, showing the duo the sights and treating them to local delicacies. Tom struggles with his large sandwich, making Jerry laugh, but Topo then drops a form of caciocavallo into Jerry, making Jerry inflate. The Italian dog and his two friends follow behind and confront Topo. However, with the help of some very large cheeses, the dogs retreat into the Bay of Naples and Tom, Jerry and Topo emerge victorious. Tom shakes Topo's hand and Jerry hugs him before they board a ship for their home. As they",
			"score": 0.5786195397377014,
			"state": -0.3
		},
		{
			"content": "the house. Tom and Jerry wave to the dog as they watch him get thrown out, and Tom breathes a sigh of relief until a snap from far off is heard behind the curtain they are hiding. Tom's tail gets caught in another mousetrap, and despite Jerry's mournful denial, the chase resumes. Mammy's appearance at the end was cut from TBS and TNT. DVD VHS Dog Trouble Dog Trouble is a 1942 American one-reel animated cartoon and is the fifth \"Tom and Jerry\" cartoon released. It was produced in Technicolor, released to theaters on April 18, 1942 by Metro-Goldwyn Mayer",
			"score": 0.6299363970756531,
			"state": 0
		},
		{
			"content": "to get his hands on Jerry, who's hiding from him in a dog pound. Tom chases Jerry into a dog pound and the dogs expel Tom. Jerry, sitting on Spike's back, taunts Tom. Tom notices a dog statue and steals the head. He walks like a dog and sneaks into the dog pound, but loses the head. He attempts to pull it out when Spike notices him. Tom puts himself back under the head and barks. Spike turns and walks away. Tom frees the head and Jerry sneaks up behind him and imitates barking. Tom is startled and almost claws",
			"score": 0.6531955003738403,
			"state": 0.2
		},
		{
			"content": "sees Jerry follow the path close to him and prepares to seize him; unfortunately, Spike is also coming around the corner. Tom grabs Spike and tries to fit him over his head. When he can't move after a few steps, Tom realizes something is up and sees the dog chomping at him. Tom hides behind a wall and spots Jerry/head. In his path, though, is a long dog akin to a train stop. The dog apparently a dachshund with two heads, until Jerry reveals himself and sticks his tongue out at Tom, only to run into the doghouse. Jerry dashes",
			"score": 0.6580835580825806,
			"state": 1
		},
		{
			"content": "drags him to the dog, who is captured instead, knowing that he is Jerry's protector. Jerry, who wants to be protected from the dog, angrily gets a saw in a tool shed, hides behind the fence, and cuts the shaft of the net as the dogcatcher passes by. In gratitude, the dog gives Jerry a whistle to use whenever he's in trouble. Jerry, with relish, thinks of the fun times he could have with provoking Tom. Jerry walks past a wooden box while Tom pokes his hand out of it and captures the mouse, who promptly whistles for his guardian.",
			"score": 0.6598917245864868,
			"state": 0
		},
		{
			"content": "Tom Cat Thomas \"Tom\" Cat is a fictional character and one of the title characters (the other being Jerry Mouse) in Metro-Goldwyn-Mayer's series of \"Tom and Jerry\" theatrical animated short films. Created by William Hanna and Joseph Barbera, Tom is a grey and white anthropomorphic domestic short haired Tuxedo cat who first appeared in the 1940 MGM animated short \"Puss Gets the Boot\" Tom was originally known as \"Jasper\" during his debut in that short; however, beginning with his next appearance in \"The Midnight Snack\" he is known as \"Tom\" or \"Thomas\". His name, \"Tom Cat\", is based on \"tomcat\",",
			"score": 0.6601355075836182,
			"state": -0.5
		}
	],
    "similar_chunks_after": [
		{
			"content": "the house. Tom and Jerry wave to the dog as they watch him get thrown out, and Tom breathes a sigh of relief until a snap from far off is heard behind the curtain they are hiding. Tom's tail gets caught in another mousetrap, and despite Jerry's mournful denial, the chase resumes. Mammy's appearance at the end was cut from TBS and TNT. DVD VHS Dog Trouble Dog Trouble is a 1942 American one-reel animated cartoon and is the fifth \"Tom and Jerry\" cartoon released. It was produced in Technicolor, released to theaters on April 18, 1942 by Metro-Goldwyn Mayer",
			"score": 0.6164276599884033,
			"state": 0
		},
		{
			"content": "he is named \"Killer\", and in \"The Truce Hurts\" he signs his name \"Butch\" on the treaty peace paper. He is also a Devil Dog in \"Heavenly Puss\". In Tom's later attempts to catch Jerry, he has to deal with Spike for bothering his son. In 1949's \"Love That Pup\", Spike was given a puppy son, Tyke, who became another popular supporting character in the \"Tom and Jerry\" cartoons. His voice was taken over by Daws Butler, who styled Spike's voice after Jimmy Durante taking after his 1940s radio series with Garry Moore. He is named \"Spike\" from then on",
			"score": 0.6420342922210693,
			"state": 1
		},
		{
			"content": "from an Italian dog. Topo then recognizes Tom and Jerry and befriends them, showing the duo the sights and treating them to local delicacies. Tom struggles with his large sandwich, making Jerry laugh, but Topo then drops a form of caciocavallo into Jerry, making Jerry inflate. The Italian dog and his two friends follow behind and confront Topo. However, with the help of some very large cheeses, the dogs retreat into the Bay of Naples and Tom, Jerry and Topo emerge victorious. Tom shakes Topo's hand and Jerry hugs him before they board a ship for their home. As they",
			"score": 0.6492788791656494,
			"state": -0.3
		},
		{
			"content": "Tom Cat Thomas \"Tom\" Cat is a fictional character and one of the title characters (the other being Jerry Mouse) in Metro-Goldwyn-Mayer's series of \"Tom and Jerry\" theatrical animated short films. Created by William Hanna and Joseph Barbera, Tom is a grey and white anthropomorphic domestic short haired Tuxedo cat who first appeared in the 1940 MGM animated short \"Puss Gets the Boot\" Tom was originally known as \"Jasper\" during his debut in that short; however, beginning with his next appearance in \"The Midnight Snack\" he is known as \"Tom\" or \"Thomas\". His name, \"Tom Cat\", is based on \"tomcat\",",
			"score": 0.6550899744033813,
			"state": -0.5
		},
		{
			"content": "movies and television shows also featuring MGM's other famous cartoon stars, Tom and Jerry. In the cartoon \"Northwest Hounded Police\", Droopy's last name was given as \"McPoodle\". In \"The Chump Champ\", it was given as \"Poodle\". Nevertheless, Droopy is generally understood to be a basset hound. Droopy first appeared in the MGM cartoon \"Dumb-Hounded\", released by MGM on March 20, 1943. Droopy's first scene is when he saunters into view, looks at the audience, and declares, \"Hello, all you happy people ... you know what? I'm the hero.\" In the cartoon, Droopy is tracking an escaped convict and is always",
			"score": 0.6724939942359924,
			"state": 0
		},
		{
			"content": "Framed Roger Rabbit\". Tom Cat Thomas \"Tom\" Cat is a fictional character and one of the title characters (the other being Jerry Mouse) in Metro-Goldwyn-Mayer's series of \"Tom and Jerry\" theatrical animated short films. Created by William Hanna and Joseph Barbera, Tom is a grey and white anthropomorphic domestic short haired Tuxedo cat who first appeared in the 1940 MGM animated short \"Puss Gets the Boot\" Tom was originally known as \"Jasper\" during his debut in that short; however, beginning with his next appearance in \"The Midnight Snack\" he is known as \"Tom\" or \"Thomas\". His name, \"Tom Cat\", is",
			"score": 0.6737866401672363,
			"state": 0
		}
	],
    "similar_chunks_standard": [
		{
			"content": "he is named \"Killer\", and in \"The Truce Hurts\" he signs his name \"Butch\" on the treaty peace paper. He is also a Devil Dog in \"Heavenly Puss\". In Tom's later attempts to catch Jerry, he has to deal with Spike for bothering his son. In 1949's \"Love That Pup\", Spike was given a puppy son, Tyke, who became another popular supporting character in the \"Tom and Jerry\" cartoons. His voice was taken over by Daws Butler, who styled Spike's voice after Jimmy Durante taking after his 1940s radio series with Garry Moore. He is named \"Spike\" from then on",
			"score": 0.4645880460739136,
			"state": 1
		},
		{
			"content": "up by holding up a sign with the words \"Yes, stupid, it's a cat!\". When Spike sees the truth, he lets out a roar like a buffalo roar and leaps into the air for the sake of revenge. Tom panics and tunnels into the ground in an attempt to escape, but Spike digs him up with his large jaws. The chase wakes up all the other dogs, who join the chase. Tom is chased to the top of a flagpole and Jerry with dog head starts barking at Tom. The others stop barking as they now hear Jerry. He loses",
			"score": 0.473520964384079,
			"state": 1
		},
		{
			"content": "to get his hands on Jerry, who's hiding from him in a dog pound. Tom chases Jerry into a dog pound and the dogs expel Tom. Jerry, sitting on Spike's back, taunts Tom. Tom notices a dog statue and steals the head. He walks like a dog and sneaks into the dog pound, but loses the head. He attempts to pull it out when Spike notices him. Tom puts himself back under the head and barks. Spike turns and walks away. Tom frees the head and Jerry sneaks up behind him and imitates barking. Tom is startled and almost claws",
			"score": 0.47613954544067383,
			"state": 0.2
		},
		{
			"content": "causing the dog to scream in pain. Tom takes a detour to the side, sets up a rake for the dog to run into if he follows him, and then watches as Spike takes the original route. Knowing he has lost his opponent, he runs back through the detour, but forgets about the rake which ends up slamming him in the face. Tom finally realizes that in order to get Jerry, Spike, who is effectively Jerry's shield, has to be removed from the picture. He does this by dangling a large piece of T-bone steak from a clothesline. A sleeping",
			"score": 0.4844946265220642,
			"state": 1
		},
		{
			"content": "sees Jerry follow the path close to him and prepares to seize him; unfortunately, Spike is also coming around the corner. Tom grabs Spike and tries to fit him over his head. When he can't move after a few steps, Tom realizes something is up and sees the dog chomping at him. Tom hides behind a wall and spots Jerry/head. In his path, though, is a long dog akin to a train stop. The dog apparently a dachshund with two heads, until Jerry reveals himself and sticks his tongue out at Tom, only to run into the doghouse. Jerry dashes",
			"score": 0.48747220635414124,
			"state": 0.5
		},
		{
			"content": "and gets wooed in a Charles Boyer voice, but stops his speech abruptly when he sees the female cat. Realizing his mistake, he throws Spike onto the ground. Tom hides from Spike's rampage until Jerry walks around the corner; he chases Jerry into Spike's house, closing the door with a murderous laugh and Dracula leer. A second later, the door opens and Jerry emerges with Spike helping him out of the doghouse, Spike laughing even more evilly as he withdraws inside. The entire dog house thrashes about as Spike beats up Tom, who attempts to flee only to be snatched",
			"score": 0.5181931257247925,
			"state": 0
		}
	]
}